INSERT INTO author VALUES (1,'Змитрок',' Бядуля');
INSERT INTO author VALUES (2,'Міхась','Зарэцкі');
INSERT INTO author VALUES (3,'Уладзімір','Някляеў');
INSERT INTO author VALUES (4,'Васіль','Быкаў');
INSERT INTO author VALUES (5,'Лявон','Вольскі');
INSERT INTO author VALUES (6,'Рыгор',' Барадулін');
INSERT INTO author VALUES (7,'Алесь','Адамовіч');
INSERT INTO author VALUES (8,'Данута','Бічэль');
INSERT INTO author VALUES (9,'Юры','Бохан');
INSERT INTO author VALUES (10,'Янка','Брыль');
INSERT INTO author VALUES (11,'Генадзь','Бураўкін');
INSERT INTO author VALUES (12,'Ларыса','Геніюш');
INSERT INTO author VALUES (13,'Ніл','Гілевіч');
INSERT INTO author VALUES (14,'Адам','Глобус');
INSERT INTO author VALUES (15,'Юры','Дракахруст');
INSERT INTO author VALUES (16,'Уладзімір','Караткевіч');
INSERT INTO author VALUES (17,'Якуб','Колас');
INSERT INTO author VALUES (18,'Янка','Купала');
INSERT INTO author VALUES (19,'Аркадзь','Куляшоў');
INSERT INTO author VALUES (20,'Іван','Мележ');
INSERT INTO author VALUES (21,'Зянон','Пазняк');
INSERT INTO author VALUES (22,'Алег','Трусаў');
INSERT INTO author VALUES (23,'Усевалад','Сцебурака');
INSERT INTO author VALUES (24,'Іван','Шамякін');
INSERT INTO author VALUES (25,'Анхела','Эспіноза');

INSERT INTO genre VALUES (1,'Мастацкая літаратура');
INSERT INTO genre VALUES (2,'Дзіцячая літаратура');
INSERT INTO genre VALUES (3,'Вершы');
INSERT INTO genre VALUES (4,'Гісторыя');
INSERT INTO genre VALUES (5,'Грамадства');
INSERT INTO genre VALUES (6,'Этнаграфія');
INSERT INTO genre VALUES (7,'Палітыка');
INSERT INTO genre VALUES (8,'Эканоміка');
INSERT INTO genre VALUES (9,'Культура');
INSERT INTO genre VALUES (10,'Біяграфія');

INSERT INTO role VALUES (1,'user');
INSERT INTO role VALUES (2,'admin');

INSERT INTO book VALUES (1,'Знакі прыпынку','978-985-6968-35-1','Цыкл “Знакі прыпынку” быў распачаты яшчэ ў 2004 годзе і доўгі час друкаваўся на старонках “Нашай Нівы”, а праз пяць год быў часткова сабраны пад вокладкай “Выбраных твораў” Някляева. Так і склалася гэтая кніга.',1,3);
INSERT INTO book VALUES (2,'Бліндаж','985-6718-65-1','Тэматыка сабраных пад адной вокладкай твораў – можна сказаць традыцыйная для Васіля Быкава – чалавек у вайне. Кніга прызначана шырокаму колу чытачоў.',1,4);
INSERT INTO book VALUES (3,'Міларусь','978-985-6914-07-5','У кнігу прозы вядомага музыкі і сьпевака, лідэра знакамітых гуртоў “Мроя”, “NRM”, “Крамбамбуля”, Лявона Вольскага ўвайшлі трынаццаць аповедаў і аповесьць “Пакуль сабачка жывы”, якія былі напісаныя больш як за дваццаць гадоў творчай працы.',9,5);
INSERT INTO book VALUES (4,'У неба пехатою','978-985-6914-13-6','Кнігу склалі вершы апошніх трох год, заключныя з якіх напісаныя ў канцы лютага 2014 года — літаральна за пару дзён да сыходу. “У неба пехатою” — так называецца верш Рыгора Барадуліна, напісаны за тры месяцы да смерці.',1,6);
INSERT INTO book VALUES (5,'Хатынская аповесць','5-340-00582-8','Аповесць нарадзілася з дакументаў, рэальных уражанняў, апавяданняў сведкаў трагедыі тысяч беларускіх вёсак, у якіх фашысты чынілі неймаверныя дзікунствы,— гэта аповесць пра сілу чалавечага духу, гэта папярэджанне ў наш трывожны час, калі чалавецтва наблізілася да той бездані, якая можа абрынуць усё жывое ў нябыт.',1,7);
INSERT INTO book VALUES (6,'Хадзі на мой голас','978-83-89185-68-6','Кніга вядомай гарадзенскай паэткі Дануты Бічэль – гэта своеасаблівае апісанне ўласнага лёсу ў кантэксце гістарычных падзей. Тут партрэты вядомых гарадзенцаў і людзей, звязаных з Гародняю.',1,8);
INSERT INTO book VALUES (7,'Зброя Вялікага княства Літоўскага 1385-1576','985-01-0469-4','Зброя Вялікага княства Літоўскага 1385-1576.Выданне ставіць перад сабой мэту прадставіць у максімальна даступнай форме матэрыял, які паспрыяў бы разуменню спецыфікі развіцця ваенна-тэхнічнай думкі на землях, што калісці ўваходзілі ў склад шматэтнічнай дзяржавы – Вялікага княства Літоўскага.',4,9);
INSERT INTO book VALUES (8,'Муштук i папка','978-985-02-0909-2','У кнігу народнага пісьменніка Беларусі Янкі Брыля ўвайшлі апавяданні i мініядюры, напісаныя ў розныя гады, i навейшая па часе напісання трагічна-ўзнёслая аповесць «Муштук i папка».',1,10);
INSERT INTO book VALUES (9,'Жураўліная пара','985-6730-70-8','У гэтай кнізе сабраны вершы, напісаныя ў 1998-2000 гадах. У іх — засяроджаны «восеньскі» роздум аб развітанні з мінулым векам, аб трывогах, сумненнях і надзеях, якія хвалююць неабыякавую душу на парозе новага тысячагоддзя.',3,11);
INSERT INTO book VALUES (10,'Лісты з Зэльвы','978-83-61617-61-7','“Проста дзіву даешся, як далёка і шырока бачыла Ларыса Геніюш са сваёй зэльвенскай хаты. Інфармаванасці Паэткі можа пазайздросціць і чалавек сённяшняй інтэрнэтнай эпохі. А тады ёй пісалі ўсе, хто хацеў ведаць праўду, хто шукаў духоўнага апірышча і знаходзіў яго ў Геніюшаўскім слове”.',1,12);
INSERT INTO book VALUES (11,'І чую я голас...','978-985-6825-23-4','У зборнік народнага паэта Беларусі Ніла Гілевіча «I чую я голас...» увайшлі вершы, паяднаныя адной, глыбока ўнутранай, магістральнай тэмай, адным вельмі характэрным, можна сказаць вызначальным для ягонага светаўспрымання, настроем. Усе гэтыя вершы друкаваліся ў часопісах і газетах, змяшчаліся ў чарговых кнігах паэзіі, у тамах «Выбранага» і Збору твораў.',3,13);
INSERT INTO book VALUES (12,'Гісторыі пра Мінск і ваколіцы','978-609-8147-32-2','Кнігу складаюць гісторыі, дзеянне якіх адбываецца ў сталічным і беларускім Мінску. Героі кнігі — надзвычайныя і, можна сказаць без усялякага перабольшвання, казачныя. Сюжэты разгортваюцца імкліва, а заканчваюцца зазвычай самым неверагодным чынам.',5,14);
INSERT INTO book VALUES (13,'ARCHE','1392-9682','Тэма нумара — Полацак. Полацак і палачане ў беларускай паэзіі ХХ стагодзьдзя.',4,15);
INSERT INTO book VALUES (14,'Чорны замак Альшанскі','978-985-6825-23-7','У рамане чарговы раз спалучаецца мінуўшчына з сёньняшнім днём, дэтэктыў з гістарычнай асновай прадстаўляе нам захапляльную і цікавую гісторыю нашага народу.',1,16);
INSERT INTO book VALUES (15,'Новая Зямля','985-5623-08-7','Першы беларускі буйны эпічны твор. За «Новай зямлёй» замацавалася назва «энцыклапедыя жыцця беларускага сялянства канца XIX — пачатку XX стагоддзяў»',1,17);
INSERT INTO book VALUES (16,'Вершы','5-340-00266-7','У кнігу ўключаны выбраныя вершы народнага паэта Беларусі Янкі Купалы.',3,18);
INSERT INTO book VALUES (17,'Паміж наступным і былым','5-340-01383-9','У гэтай кнізе народнага наэта Беларусі Аркадзя Куляшова (1914—1978) чытач знойдзе лепшае з творчай спадчыны выдатнага пісьменніка, які ўзбагаціў нашу літаратуру рамантычна адухоўленай, высокаметафарычнай, напоўненай багаццем філасофскіх вобразна-асацыятыўных сувязей i адначасова ў найвышэйшых сваіх праявах глыбока інтымнай, прапушчанай праз жывое трапяткое сэрца паэзіяй.',3,19);
INSERT INTO book VALUES (18,'Людзі на балоце','985-02-0188-6','Раман “Людзі на балоце” Івана Мележа – першая частка “Палескай хронікі” – адна з вяршынь беларускай літаратуры.',1,20);
INSERT INTO book VALUES (19,'Народная Праграма «Вольная Беларусь»','978-83-935476-7-8','Гэта праект новай Беларусі. Распрацаваны ў 2017 г. салідарным калектывам палітыкаў і спэцыялістаў дзеля вольнай прышласьці краіны, для выкарыстаньня будучым Тымчасовым ці Пераходным Урадам дзяржавы альбо іншым палітычным утварэньнем, якое пасьля ліквідацыі антынароднага рэжыму возьме на сябе адказнасьць за лёс і будучыню Рэспублікі Беларусь.',7,21);
INSERT INTO book VALUES (20,'Невядомая нам краіна','978-985-7057-78-8','Беларусь у яе этнаграфічных межах.',4,22);
INSERT INTO book VALUES (21,'Крушня','985-6718-67-8','Збор вершаў і прозы маладога беларускага пісьменьніка – першы ў жыцьці самаго аўтара. Праз сваю творчасьць аўтар спрабуе перадаць, сваё сьветаўспрыманьне і бачаньне сёньняшняга жыцьця.',1,23);
INSERT INTO book VALUES (22,'Трывожнае шчасце','978-985-02-0996-2','У пенталогіі «Трывожнае шчасце» Іван Шамякін на аснове ўласна перажытага паказаў лёс усяго пакалення, якое прайшло праз цяжкія выпрабаванні вайны і ў нялёгкіх пасляваенных умовах аднаўляла родны край.',1,24);
INSERT INTO book VALUES (23,'Раяль ля мора','978-609-8147-30-8','Анхела Эспіноса Руіз (гішп. Ángela Espinosa Ruiz) нарадзілася ў Малазе (Гішпанія) 6 лютага 1993 г. Яна навучылася чытаць і пісаць самастойна на сваёй роднай гішпанскай у веку трох гадоў, і пачала пісаць вершы, калі ёй было шэсць. Па-беларуску пачала пісаць паэзію ў 2014 г. (паэтка таксама мае творы на ангельскай, французскай ды ўкраінскай мовах). У тым самым годзе апублікавала зборнік вершаў “Раяль ля мора” ў Менску і электронны зборнік “Памяць пра будучыню”. Ейныя вершы друкаваліся ў часопісе “Маладосць” і ў блогу аўтаркі, “Іншаземка, якая піша па-беларуску”.',3,25);


INSERT INTO book_info VALUES (1,4,12,1);
INSERT INTO book_info VALUES (2,2,20,2);
INSERT INTO book_info VALUES (3,3,15,3);
INSERT INTO book_info VALUES (4,15,20,4);
INSERT INTO book_info VALUES (5,8,17,5);
INSERT INTO book_info VALUES (6,20,10,6);
INSERT INTO book_info VALUES (7,2,12,7);
INSERT INTO book_info VALUES (8,10,20,8);
INSERT INTO book_info VALUES (9,4,12,9);
INSERT INTO book_info VALUES (10,9,15,10);
INSERT INTO book_info VALUES (11,4,36,11);
INSERT INTO book_info VALUES (12,9,20,12);
INSERT INTO book_info VALUES (13,2,50,13);
INSERT INTO book_info VALUES (14,4,35,14);
INSERT INTO book_info VALUES (15,5,25,15);
INSERT INTO book_info VALUES (16,3,20,16);
INSERT INTO book_info VALUES (17,4,15,17);
INSERT INTO book_info VALUES (18,1,10,18);
INSERT INTO book_info VALUES (19,5,15,19);
INSERT INTO book_info VALUES (20,2,10,20);
INSERT INTO book_info VALUES (21,3,12,21);
INSERT INTO book_info VALUES (22,5,25,22);
INSERT INTO book_info VALUES (23,4,25,23);


INSERT INTO person VALUES (1,'Анатоль','Луцэвіч','Пятровіч','+375 29 3926937','1975-12-09','Смаргонь, Скарыны 13/1');
INSERT INTO person VALUES (2,'Яўген','Кукс','Аляксандравіч','+375 29 7647110','1988-02-24','Мінск, Матусевіча 65/149');


INSERT INTO customer VALUES (1,'2017-09-03 00:00:00','e10adc3949ba59abbe56e057f20f883e','admin@gmail.com',1,2);
INSERT INTO customer VALUES (2,'2017-09-03 00:00:00','e10adc3949ba59abbe56e057f20f883e','user@gmail.com',2,1);
